'''
1. Создайте список с именами пяти друзей, затем выведите эти имена по одному, обращаясь к каждому элементу списка.
'''
#write your code here

# names = ['Azat', 'Amir', 'Mudzha', 'Islam', 'Dariya']
# for x in names:
#   print(x)

"""
2. Дан список из чисел, запишите чётные числа в один лист а нечётные в другой лист и выведите результат.

"""
#write your code here

# list = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
# print(list[0::2])
# print(list[1::2])
"""
3. Даны два списка с рандомным набором чисел, объединить эти списки, а затем вывести сумму всех чисел.
"""
# write your code here

# list1 = [12, 23, 45, 54, 87]
# list2 = [23, 56, 1, 2, 6]
# ast = list1 + list2





"""
4. Дано номер года. Требуется определить, является ли год с данным номером високосным. Если год является високосным, 
то выведите YES, иначе выведите NO. Напомним, что в соответствии с григорианским календарем, 
год является високосным, если его номер кратен 4, но не кратен 100, а также если он кратен 400.
"""
#write your code here

year_ =input('Введите желаемый год: ')
if year == 



